{"_id":{"$oid":"68aa8f209eefa6f5e84492f8"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 1","content":"For free distribution 125 After studying this chapter, you will understand the following: ² Content of a website ² Fundementals of Web designing ² Publishing a website ² Maintaining a website 5.1 Structuring information for web designing There are several aspects that attention should be paid when designing a web site. Imagine you are member of a group of students assigned to design a website. You should consider factors such as the purpose, the user, and how to maintain the website etc. 5.1.1 Web applications There are several web applications. Examples are as follows. i) Information Communication There are websites designed to communicate various information such as educational and health for the users. Example - www.nie.lk, www.surgery.lk, www.webopedia.org ii) e Commerce This includes websites which sell goods and services through the Internet. Example - www.farlin.lk, www.lego.lk, www.amazon.com iii) Entertainment There are websites for entertainment which provides download materials such as songs, films and teledramas, games, broadcasts and telecasts Example - www.islandcricket.lk, www.netflix.com, www.youtube.com 5 Web Designing Using Multimedia","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f209eefa6f5e84492fb"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 2","content":"126 For free distribution iv) Advertising These websites provides information on goods and services provided by various organizations. Example - www.onclickads.net, www.adcash.com, www.myadvertisingpays.com v) News These websites publish news using multimedia. Example - www.itnnews.lk, www.rupavahini.lk, www.bbc.co.uk vi) Social Media These websites provide facilities to develop social networking among various groups depending on their educational background, occupation, tastes or other factors. Example - www.facebook.com, www.linkedin.com, www.twitter.com vii) Search engine These websites provide facilities to find information from the World Wide Web using a word or a phrase as the key. Example - www.google.com, www.msn.com, www.bing.com viii) Personal These are often used by popular persons such as writers and politicians to disseminate their information. Example - www.president.gov.lk, www.arthurcclarke.net, www.nelsonmandela.org 5.1.2 Web user groups Those who access a website and use are known as the users of the website. For instance, www.google.com is used by many people around the world and they are the users of the Google website. In designing a website, it is understood that the user is important. The following are useful in understanding them: 1. Language and culture 2. Age 3. Educational level 4. Gender 5. Preferences","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f219eefa6f5e84492fe"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 3","content":"For free distribution 127 When designing a new website, various methods can be used to understand the target user group. For instance, 1. conducting a study on target users. 2. Analyzing similar websites. For example, let us consider, the home page of the official Website of Sri Lanka (Figure 5.1) and website of Telecommunications Regulatory Commission of Sri Lanka. (Figure 5.2). You can observe that there are facilities to access them in all the three languages. The website in Figure 5.2 provides the facilities to change the font size according to the user preference and to access social networks. To access Sinhala medium To access English medium To access Tamil medium Figure 5.1 - Home Page of www.srilanka.lk","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f219eefa6f5e8449301"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 4","content":"128 For free distribution Change font size Search Videos Images Texts Copyright and the last updated year Navigation between web page Change the language Hyperlinks for popular social networks Figure 5.2 - Home page of www.trc.gov.lk 5.1.3 Web content All the audio-visual information and services a user comes across in a website are called its web content. The web content of the new website should be selected considering the need/s of the user identified in the user group analysis. Web content should include the information to be communicated to the user as well as all the services to be provided to the user. Various types of information and services can be found in the web content of websites. Following are some of them: ² Texts : information given in short ² Images : photos taken from a camera, clip arts, drawings, scanned ² Sound : songs, voice clips ² Video : video clips ² Animations ² Copyrights and information about updates","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f229eefa6f5e8449304"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 5","content":"For free distribution 129 ² Hyperlinks to other documents, pictures, audio-visual files, and social networks ² Advertisements ² Search facilities ² Facilities to download certain software required to use the website. As an example of identifying web content, examine the website of Telecommunications Regulatory Commission (www.trc.gov.lk) given in Figure 5.2. 5.1.4 Content Management Systematic organization of the selected content of a website is known as content management. The main objective of this is to provide facilities to the users to use the website more effectively. Given below are some features of a well organized website. ² Easy to use ² Can find the information user needs fast ² Attracts users ² Easy to update ² Has room to add new features later If the amount of information selected for the web content of the website is small, organizing web content is easy. However, if it contains a large amount of various types of audio-visual information, various methods are used organizing web content of such websites. Following are some examples; 1. Classification based on site map By developing a site map to classify the web content, one can get a clear picture about the web pages need to be created in the website and the hyperlinks (link among pages) need to be created among these. For instance, in the site map shown in Figure 5.3 - website of a school, the number of web pages need to be created is indicated in square structures and the hyperlinks need to be created for interlinks among those pages are indicated in lines.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f229eefa6f5e8449307"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 6","content":"130 For free distribution Home Page Current Information History Sports Old Pupils School Development Committee Contact Elle Literature Buddhist English Cricket Volley ball societies Management Structure Figure 5.3 - Site map of website of a school 2. Display a summary of the entire content of the website in the home page To manage the space in the home page; ² Use of main menu and sub menu (Figure 5.4) ² Use of hyperlink (Figure 5.5) ² Sub Menu Main Menu Figure 5.4 - Main menu and Sub Menu 3. Present information in brief The attention of the user may not be drawn to some information, when a large amount of information is included in a single web page. Therefore, the content of a single web page should be limited. 4. Use of numbered lists, bulleted lists and indentation This prevents the user getting exhausted by reading long text paragraphs. 5. Providing the facility for the user to navigate the website easily","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f239eefa6f5e844930a"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 7","content":"For free distribution 131","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f239eefa6f5e844930d"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 8","content":"132 For free distribution 6. Updating Web site should be easy to update by the person maintaining the site. The accuracy of information is assured when the copyrights and the updated time periods are included clearly in each page. 5.1.5 Structure and layout Structure and layout are the features such as backgrounds, tables, frames, font types, font sizes, font shapes. Some of them are as follows; 1. Maintaining the identity of the website in each page This means preserving the identity of the web pages of a single website by keeping uniformity between backgrounds, font types, font sizes, font shapes etc. 2. Highlighting important information For this, methods such as changing the font types and font sizes or different colours in the related information can be adopted. 3. Ability to access the website from any computer Figure 5.6 - Various sizes of screens Various users use different types of personal computers, various devices such as mobile phones to browse websites. Different sizes of screens are used as shown in Figure 5.6. Since the screen resolutions of these devices are different, some web pages are displayed in different ways on different screens. The website should be constructed in order to adjust the size of the webpage to that of the screen automatically. Activity Examine the websites given below with your teacher and discuss the strengths and weaknesses in their design. www.srilanka.lk www.schoolnet.lk www.doenets.lk www.bbc.co.uk/education","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f249eefa6f5e8449310"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 9","content":"For free distribution 133 5.1.6 Selecting media resources When selecting any type of media resource for a website such as various texts, pictures, sounds, videos and animations, several factors should be considered. The following are some such things to be considered; 1. Size There is a very close connection between the size of media resources accommodated to a certain web page and the time taken to download that web page. If the size of these is high, more time is spent to opening that web page as more data should be downloaded from the web server to the users' computer (client computer). Since the users have to stay for a long time to use the web page, there may be a possibility for them to leave the site. Therefore, various methods are followed depending on to the media type. Following are some examples; ² Graphics ◦ Reducing the amount of pixels by removing unnecessary sections using Crop/Trim in graphics software ◦ graphic compression ² Video files ◦ Reducing frame size ◦ Reducing resolution ◦ Adjusting frame rate ◦ Removing unnecessary frames and sound ² Audio files ◦ Reducing the bit rate ◦ reducing the sample rate ◦ reducing number of channels ◦ removing or reducing unnecessary sound 2. Use of media resources adhering copyrights If you use media resources created by another person in your website, it is your responsibility to obtain necessary permission from the owner. If not, it is unethical and may lead to legal issues as well. However, as per the fair use of principles, it is possible to use media resources without permission for activities such as news reporting, academic purposes and critic.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f249eefa6f5e8449313"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 10","content":"134 For free distribution Activity Develop a plan to school website related to sub topics 5.1.1 to 5.1.6 mentioned above. 5.1.7 Use of Basic HTML H yper T ext M arkup L anguage, which is known as the acronym HTML, is the language used for documents in the World Wide Web. An HTML document which can be displayed through a web browser is called a web page. Unlike the computer programming languages you learnt earlier such as Pascal, the codes of HTML language shows the web browser how the web page content should be displayed on the computer screen. Hence, HTML is not a computer language but a Markup Language. Now let us design some simple web pages using HTML. Figure 5.7 - Open Notepad Activity No 01 Step 1 - As shown in Figure 5.7 Start → All Programs → Accessories → Notepad Notepad is a simple software used in the Windows operating system. Step 2 - Write statements on the Notepad as shown in Figure 5.8. Figure 5.8 - HTML statements written in Notepad","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f259eefa6f5e8449316"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 11","content":"For free distribution 135 Step 3 - As shown in Figure 5.9, type the file name of that notepad page as myfirst.html and select the file type as All Files. Then save it in a suitable folder. Figure 5.9 -The dialogue box appear in saving the Notepad page Step 4 - Open the file myfirst.html. Your first web page will be displayed as shown in Figure 5.10. Figure 5.10 - An HTML file which is open Step 5 - Instead of the phrases written on the notepad page in the second step above “This is the title” and “My first web page”, write different phrases and create more web pages. Step 6 - Instead of using a word processing software like notepad, software which are called HTML editors can be used to write HTML code. Following are some software with the web addresses to download. 1. CoffeeCup (www.coffeecup.com/html-editor) 2. Seamonkey Composer (www.seamonkey-project.org) 3. Eclipse (https://marketplace.eclipse.org/content/html-editor- wtp) Install any one of the above software in your computer. Step 7 - Open the web designing tool in your computer. Given in Figure 5.11 is how the HTML editor named CoffeeCup is opened after giving the command File → New HTML document.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f259eefa6f5e8449319"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 12","content":"136 For free distribution Figure 5.11 - Display of HTML editor in Coffeecup You can see that a substantial number of phrases you wrote in step 02 on notepad page are automatically written here. It makes your task easier. Now you can insert the items in the proper places in your web page. Figure 5.12 shows how the phrases “This is the title” and “My first web page” you inserted in the first web page. Save this in your folder as coffeecup.html using the command File → Save As. Preview tool “This is the Title” “My first web page” Figure 5.12 - Insert elements in CoffeeCupHTML editor","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f259eefa6f5e844931c"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 13","content":"For free distribution 137 Step 8 - Now check the web page using preview tool. Design more web pages by inserting more new phrases. Observation So far you have written HTML documents which include phrases of HTML language or HTML codes using notepad and other tools. What you use in angular brackets like <html>, <head>, <title> are types of HTML tags, which is a main feature of HTML. These tags indicate to the web browser how the web page content should be displayed to the user. This means the structure and layout you have selected are entered in the web page using HTML tags. 5.1.8 The Basic Structure of an HTML Document Figure 5.13 given shows some essential tags in the basic structure of an HTML document. Mostly, a tag consists of an opening tag and a closing tag. However, you will later come across some tags later which consist of an opening tag only. <html> <head> </head> <body> </body> </html> Starting html tag Starting head tag Closing head tag Starting body tag Closing body tag Closing html tag } } head body Figure 5.13 - Basic structure of a HTML document An HTML document consists of two main parts; head and body. The figure 5.13 shows clearly that the opening <html> tag shows the opening of the document and the closing </html> tag shows the ending of the document.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f269eefa6f5e844931f"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 14","content":"138 For free distribution Web page content should be included in the body part. Consider how you indicated “My first web page” in your first web page. There are special occasions where you make notes in the Head part. For instance, consider again how you mentioned “This is the title” in <title> tag in your first web page. This is displayed on Title Pane which is at the top most of your web page. 5.1.9 Features of HTML i) HTML tags show the web browser how the web page should be displayed. Such commands in an HTML document are called HTML codes. ii) There should be a pair of angular brackets (< >) at the beginning and end of an HTML tag. E.g. - <p> to mark the beginning of a paragraph iii) Generally, HTML closing tags are given in pairs. “/” (back slash) with the name of the tag should be indicated in the ending tag. E.g. - <p> to mark the beginning of a paragraph and </p> to mark the end of it iv) Generally HTML tags are not case sensitive. That means, the use of capital or simple letters of the English language does not affect the meaning. E.g. - <TITLE>, <Title> or <title> does not make any difference. v) There will be no error messages if the tag is indicated incorrectly, however, the web browser will ignore that particular. vi) There are three parts of an HTML tag – element, attribute and value. E.g. - Following is the HTML code to display the plain text “I am a student” in Times New Roman font type in blue colour. <font face=“iskoolaPota” color = “blue”> I am a student </font> Attributes values Element","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f269eefa6f5e8449322"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 15","content":"For free distribution 139 The features related to a certain HTML are indicated in the opening tag only and the values related to it are always indicated within inverted commas. 5.1.10 Designing a web page Let us design a web page which gives a short introduction about “Sri Lanka” as given in Figure 5.14. Title text Picture A paragraph A hyperlink A table Bullet rows Bullet rows Figure 5.14 - A web page on a short introduction about Sri Lanka Preparing the Title Text Open a new web page using HTML editor. Then enter the HTML code as shown in the Figure 5.15. Save that web page in a folder in your computer and provide a suitable file name. Display the web page using a web browser and compare it with the output given in Figure 5.15 as well as the title text given in Figure 5.14.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f279eefa6f5e8449325"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 16","content":"140 For free distribution <html> <head> <title> Sri Lanka </title> </head> <body> <h2><center><font face=\"Arial\" color=\"blue\"> SRI LANKA </font></center></h2> </body> </html> O u t p u t SRI LANKA Header tag Center tag Font tag Figure 5.15 - HTML code to prepare the title text and its output Let us consider the HTML tags further. Header tag Methods such as increasing the font size, making the letters bold etc are used to highlight elements such as headings, sub-headings and other texts from the rest of the document. For a web page, this is carried out using the tag called header. There are header tags from <h1> to <h6> in the order. Out of these, <h1> makes the letters the biggest and the bold. The size and the thickness of the letters are decreased gradually from <h1> to <h6>. Instead of <h2> tag of your web page, use other header tags and adjust the title to a proper size, after checking how it is displayed on the web page. Font tag As you have learnt already, an HTML tag consists of three main components – element, attribute and value. There are three main attributes in the Font tag (ie. size, face and color). The font size attribute shows the size of the letters. For this, you can assign the values in the range from 1 to 7. Default is size 3. That is the size displayed automatically by the web browser when you do not assign a value to the Font size. Font face attribute shows the type of letters. You can assign any type of letters available in your computer as its value. E.g. - “Ariel”, “Verdana” Font color attribute shows the colour of the letters. There are two ways to assign values for this.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f279eefa6f5e8449328"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 17","content":"For free distribution 141 i) Providing the names of the sixteen standard colours as they are, in Figure 5.16 Figure 5.16 - Standard Sixteen Colours Example: <font size = zz 5\" face = zz verdana\" color = zz fuchsia\" >SRI LANKA</font> Output SRI LANKA ii) Using RGB hexadecimal codes based on the basic colours red, green and blue, as shown in Figure 5.17. The code is arranged here with six numbers from 0 to F preceding # sub feature. Here, the first two numbers represent the red, the next two numbers represent the green, and the last two numbers represent the blue. Figure 5.17 - Some RGB colour combinations Example: <font size = zz 5'' face = zz verdana\" color = ''#0000FF'' >SRI LANKA</ font> Output SRI LANKA","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f289eefa6f5e844932b"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 18","content":"142 For free distribution Center tag This is a tag used to align the title of your web page to the centre along the horizontal axis. This can be used not only for a text, but also for other elements such as a picture. There are several tags like the Center tag which can be used to design texts. Given below in Table 5.1 shows some of them. Table 5.1 - Text Formatting Tags HTML symbol How the letters are designed Example <b> Bold SRI LANKA <i> Italic SRI LANKA <u> Underline SRI LANKA <em> Emphasis SRI LANKA <s> strike out SRI LANKA <sup> Superscript SRI LANKA <sub> subscript SRI LANKA <marquee> horizontally moving text (Check this by applying to a web page) Example: <b> SRI LANKA </b> Output SRI LANKA Refer following sites and study further about HTML tags used to design texts in web sites. Example: http://www.w3schools.com/html http://www.tutorialspoint.com/html Activity Design a web page using the name of your school instead of the school name given in the Figure 5.18. Use different designs you wish to add using Sinhala unicode font (“iskoola pota”). Change 'Encoding' as unicode in 'Save As' dialog box when saving the document (Figure 5.19). Compare your web page with the output shown in Figure 5.20.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f299eefa6f5e844932e"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 19","content":"For free distribution 143 <html> <head><title> Text Formatting </title></head> <body> <font face = ''iskoola pota'' color = ''Green'' ><h1> 1' name of your school </h1></font> <font face = ''iskoola pota'' color = ''lime'' ><h2> 2' name of your school </h2></font> <font face = ''iskoola pota'' color = ''olive'' ><h3> 3' name of your school </h3></font> <font face = ''iskoola pota'' color = ''Navy'' ><h4> 4' name of your school </h4></font> <font face = ''iskoola pota'' color = ''blue'' ><h5> 5' name of your school </h5></font> <font face = ''iskoola pota'' color = ''Aqua'' ><h6> 6' name of your school </h6></font> <font face = ''iskoola pota'' color = ''Teal'' ><h6> 7' name of your school </h6></font> </body> </html> Figure 5.18 - HTML document Figure 5.19 - Save as dialog box related to activity above Figure 5.20 - Output","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f299eefa6f5e8449331"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 20","content":"144 For free distribution Activity 1. Find out other text formatting tags by referring to websites and books related to HTML codes and prepare a table similar to the Table No 5.1. 2. Design a web page using other text formatting tags instead of header tags given in Figure 5.18. 3. Study <marquee> tag further and design a suitable web page. Inserting and formatting an image Select a picture suitable to insert to your web page. When inserting images to a web page, it should be relatively low size file type such as .png , .gif or .jpeg. The images to be used in the HTML document can be saved in a separate folder. Image tag <img> tag, which is called the image tag, is used to link an image to a web page. This tag does not have two opening and ending tags. You will come across several such tags later which are called blank tags or empty tags. Though there are about 12 attributes related to the <img> element, only some important ones are explained in Table No 5.2. Table No 5.2 - Some attributes related to <img> element Attribute Explanation about the value Example source or src The image file name should contain the file extension also. If the image is in another folder, the relevant path should be given. src=“C:\\Users\\ Pictures\\pet.png” alternative or alt If the image given by the src attribute is not available in the text, that should be displayed image position indicated here. alt = “map” width The width of the image to be displayed is indicated as the number of pixels or as a percentage of the size of the page. width = “100” or width = “50%” height The height of the image is indicated as the number of pixels or as a percentage of the size of the page. height = “100” or height = “50%”","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f299eefa6f5e8449334"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 21","content":"For free distribution 145 border If a border is needed around the picture, its thickness should be indicated as the number of pixels. Or else, indicate its vaule as “0”. border = “3” align A suitable alignment value can be used among left, right, top, bottom, and middle. align = “middle” Output Example - < img src = ''C:\\Users\\Pictures\\srilanka.jpg'' alt = ''Map'' width = ''100'' height = ''200'' border = ''3'' align = ''middle'' > Enter the code as in Figure 5.21 in order to insert the image to web page on Sri Lanka in section 5.10. Open the web page on web browser and compare it with the output in Figure 5.14. <html> <head><title> Sri Lanka </title></head> <body><h2><center><font face=\"arial\" color =\"blue\"> SRI LANKA </font></center></h2> <center><img src=\" C:\\Users\\Pictures\\srilanka.jpg\" ></center><center><font face=\"arial\" size=\"2\"> A map of Sri lanka </font></center> </body> </html> O u t p u t Figure 5.21 - Code to enter the image and the output Inserting and formatting a paragraph To insert a paragraph below the image, insert the code given below in Figure 5.22 to the web page. Open the web page and compare with the output in Figure 5.23 and Figure 5.14.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2a9eefa6f5e8449337"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 22","content":"146 For free distribution <html> <head><title> Sri Lanka </title></head> <body><h2><center><font face=\"arial\" color=\"blue\"> SRI LANKA </font></center></h2> <center><img src=\" C:\\Users\\Pictures\\srilanka.jpg\" ></center> <ce nter><font face=\"arial\" size=\"2\"> A map of Sri lanka </font></center> <p> Sri Lanka is an island located off the southern coast of India. Sri Lanka is surrounded by the Indian Ocean. The geography of Sri Lanka includes coastal plains in the north and hills and mountains in the interior. The government system is a republic. The chief of state and head of government is the President. </p> </body> </html> paragraph tag Paragraph Figure 5.22 - Insert a paragraph Figure 5.23 - Output of code in Figure 5.24 Let us learn about the <p> tag further which is used as the paragraph tag. Paragraph tag The paragraph inserted using the <p> tag is left aligned by default. Four different types of alignments can be used on “left”, “right”, “center” and “justify” attribute in <p> tag.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2a9eefa6f5e844933a"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 23","content":"For free distribution 147 Table 5.3 - Paragraph alignment Example Tag Alignment < p align = ''left'' > Left < p align = ''center'' > Center < p align = ''right'' > Right < p align = ''justify'' > Justify How to keep a gap between words This is provided by using &nbsp: tag which belongs to the the type of character entity tags. <p> The government system is &nbsp; a republic. The chief of state and head of government is &nbsp; &nbsp&nbspthe President. </p> Output The government system is a republic. The chief of state and head of government is the President. Activity Identity some more tags which belong to the character entity type by referring to various websites or books related to HTML codes. Inserting some rows Enter the code given below in Figure 5.24 to your web page to insert some rows below the paragraph you entered in the third step.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2b9eefa6f5e844933d"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 24","content":"148 For free distribution Line break tags Figure 5.24 - Code to insert a few rows Figure 5.25 - A part of the output related to the code given in Figure 5.24 The <br/> tag, which is called the line break to break lines, belongs to the type of blank tags/empty tags similar to the <img> tag you have used earlier. Identify that only <br/> tag is used exactly in the position where you need to break the line, without using two opening/ending tags. Inserting Lists When a number of related items are indicated in an order, it is called a list. Mostly, these items are indicated one below the other. There are three types of main lists in web page designing in the HTML language. i) Unordered lists <ul> symbol is used to mark the beginning of an unordered list and the type attribute is used to show the shape of the special symbol with its element. Here are the three values which can be assigned to it.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2b9eefa6f5e8449340"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 25","content":"For free distribution 149 1. Disc 2. Square 3. Circle <li> tag is used to separate each item in the list. ² Sinhala ² Tamil ² Muslim ² Burgher Output <ul type = ''disc'' <li> Sinhala</li> <li> Tamil</li> <li> Muslim</li> <li> Burgher</li> </ul> Figure 5.26 - <li> tag and its output ii) Ordered list A number of items arranged in order using numbers or letters are called an ordered list (Figure 5.27). Two tags - <ol> and <li>, are used together to indicate these in web pages. Table No 5.4 - Values which can be assigned to <ol> type attribute and their meanings Value Meaning 1 Hindu Arabic numbers A English capital letters a English simple letters i Roman numbers with English simple letters I Roman numbers with English capital letters Example - I. Sinhala II. Tamil III. Muslim IV. Burgher Output <ol type = ''I'' > <li> Sinhala </li> <li>Tamil</li> <li>Muslim</li> <li>Burgher</li> </ol> Figure 5.27 - Ordered Lists","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2c9eefa6f5e8449343"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 26","content":"150 For free distribution iii) Description/definition list Description lists are used to provide a description with the list (Figure 5.31) Table 5.5 - Description list Tag Description <dl> Beginning of a description list <dt> Introduction of list <dd> Description of the list Example: Write the HTML code as given below to display a description list as shown in Figure 5.28 in a web page and check the output. Output < dl> <dt> Main subjects for the science stream </dt> <dd> Biology </dd> <dd> Physics</dd> <dd> Chemistry </dd> <dd> Combined Maths </dd> <dt> Main subjects for the commerce stream </dt> <dd> Economics </dd> <dd> Business Studies </dd> <dd> Accountancy </dd> <dl> Figure 5.28 - Description list Activity Design web pages which contain lists as above using items you like.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2c9eefa6f5e8449346"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 27","content":"For free distribution 151 4. It is possible to design web pages in a way that one type of a list contains another type of list. Given below is such a code and its output which is displayed in Figure 5.29. Build various forms of similar lists. Figure 5.29 - Coding of different lists and its output <ul type = ''disc''> <li> Sinhala </li> <li>Tamil <ol type = ''1''> <li> Sri Lankan Tamil </li> <li> Indian Tamil </li> </ol> </li> <li> Muslim </li> <li> Burgher </li> </ul> O u t p u t Hyperlink Let us create a hyperlink for “President” as shown in Figure 5.14. Enter the code for it to your web page as given in Figure 5.30. <html> <head><title> Sri Lanka </title></head> <body><h2><center><font face=\"arial\" color=\"blue\"> SRI LANKA </font></center></h2> <center><img src=\" C:\\Users\\Pictures\\srilanka.jpg\" ></center> <center><font face=\"arial\" size=\"2\"> A map of Sri lanka </font></center> <p> Sri Lanka is an island located off the southern coast of India. Sri Lanka is surrounded by the Indian Ocean. The geography of Sri Lanka includes coastal plains in the north and hills and mountains in the interior.The government system is a republic. The chief of state and head of government is the <a href=”http://www.president.gov.lk“ >President.</a></p> People in Sri Lanka have four main categories in ethnically. They are <br/> Sinhala <br/>Tamil <br/> Muslim <br/> Burghers <br/> </body> </html> href attribute Anchor tag Attached file Figure 5.30 - Creating a hyperlink for a text","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2d9eefa6f5e8449349"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 28","content":"152 For free distribution Figure 5.31 - Output of the code related to the hyperlink While displaying the web page, more the Mouse to the text “President” which contains the hyperlink. The related file can be opened by double clicking on them or by giving the Open command after right clicking. Anchor tag Hyperlinks can be created for a certain text or image by using <a> tag in HTML codes. There are some attributes related to this tag as well. The most important attribute which is href, shows the place which should create the link. If it is a file in the same folder which contains the web page, it is adequate to indicate the file name with the file extension. Example: <a href=“President.jpeg”>President </a> <a href=“President.html”>President </a> However, if it should be connected to another web page, the relevant path should be indicated accurately. Example: <a href=“http://www.president.gov.lk/president”>President </a> Activity 1. Create a hyperlink to the picture of your web page with a suitable website in internet. 2. Prepare a list of attributes related to <a> tag by referring to websites or books on HTML codes.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2d9eefa6f5e844934c"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 29","content":"For free distribution 153 Inserting a Table Information such as various texts and pictures can be presented in a more organized way in rows and columns by including a table to a web page. After the HTML code written using the <br/>tag to include the four ethnic groups as Sinhala, Tamil, Muslim, Burgher in your web page, add the code as given in Figure 36 to include the table. Table tag Border attribute Tag for rows of the table Creating cells which include data Figure 5.32 - Code to insert the table Then display your web page and compare it with the output given in Figure 5.33 which indicates the relevant section only, as well as with Figure 5.14 Figure 5.33 - Output related to the code of Figure 5.32","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2d9eefa6f5e844934f"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 30","content":"154 For free distribution Table Tag This tag marks the beginning of a table and the attributes to decorate the table are used with its element. Given below in Table No 5.6 are some of them. Include these attributes to decorate your table. Table 5.6 - Some attributes belong to <table> tag Attribute Explanation align Shows how the table should be aligned with the other texts in the page. Left, center, right are used as values. width Shows the width of a table as the number of pixels or a percentage of the width of the web page. height Shows the height of a table as the number of pixels or a percentage of the height of the web page. bgcolor Shows the background colour of the table. Values can be assigned in the same way colours were assigned to the texts. border “1” is used as the value if a border is needed around the cells of the table, if not “0” is used as the value. boardercolor Shows the colour of the boarder. background Used to include a picture to the background of the table. File name or the path related to the picture is used as the value. cellpadding Shows the gap between cell border and its content. value is indicated as a number of pixels. cellspacing Shows the gap between cells. Value is indicated as a number of pixels. Example : <table border = \"1\"width =\"400\" height =\"150\" cellpadding = \"5\" cellspacing = \"5\" bordercolor = \"green\" bgcolor = \"yellow\"> Output Figure 5.34","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2e9eefa6f5e8449352"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 31","content":"For free distribution 155 Caption Tag This tag is used to include a title or a description of the table above it. Even if there are no attributes, this caption can be decorated using the tags related to text decoration. Example : < Caption><b><u>Principle Forms of Land use </ u></ b></ Caption> <tr> Tag This element, which is indicated as <tr>, adds a new row to the table. Just like in <table>, the attributes such as \"align\", \"bgcolor\", \"border\", \"bordercolor\" can be used differently for separate rows. Example : <tr bordercolor = ''green'' bgcolor = ''yellow'' background = ''image. png''> <td> Tag Used to create cells to include data in a row. Just like for rows, attributes can be added separately for cells as well. Example : <td width = ''4'' bordercolor = ''green'' bgcolor = ''yellow'' background =''image.png''> Sometimes, cells should be merged adding several rows or columns of the table. There are two attributes used for this. 1. Colspan - Used to create a cell merging several columns. The value of this attribute is the number of columns merged. Example : Figure 5.35 2. Rowspan - Used to create a cell merging several rows. The value of this attribute is the number of rows merged.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2e9eefa6f5e8449355"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 32","content":"156 For free distribution Example : <th> tag Figure 5.36 <th> Tag This tag, which is called the table header tag, is used to indicate the captions of the rows of table. However, this can be used instead of <td> tag related to any cell of the table. What is special about this is that the text in the cell will be bold. Including colspan and rowspan, all the attributes related to <td> tag can be used for this tag as well. Activity Create a web page which includes a table as given below. Make changes to the table using what you have learnt so far and understand thoroughly various tags related to creating tables and their attributes. Create a website as your team has planned using a suitable HTML editor.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2f9eefa6f5e8449358"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 33","content":"For free distribution 157 5.2 Web Designing Software A sound knowledge of HTML language is essential in designing websites using simple word processors or HTML editors. Further HTML coding takes more time. Moreover, the basic HTML codes need changing for updates and alterations. But, there are other web designing software which facilitate web designing quicker and more attractive. There the graphical user interface provides facilities to designing, editing, preview and upload. As per the concept WYSIWYG ( What You S ee Is What You Get), you can create web pages in the same way you design them on the graphical user interface. There are various types of web designing software. For instance, 1. Web authoring tools 2. Content Management Systems (CMS) 5.2.1 web authoring tools The special feature of this type of web designing software is that the relevant HLML document is automatically prepared in a separate interface while the designer is finishing the web page using a graphical user interface. If the designer has knowledge of HTML coding, web page designing can be done using graphical user interface as well as HTML document. There are many open source web editors such as Kompozer, Ckeditor, Bluegriffon which can be downloaded from Internet while there are lots of web editors like Adobe dream viewer, Microsoft front page, Visual studio that are to be purchased. Figure 5.37 - Standard symbols of some open source web editors Designing a website using a web editing software Imagine that a website of six pages is planned to design on the topic \"Various systems of human body\". Figure 5.38 shows the structure, preview and the content of its Home Page.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f2f9eefa6f5e844935b"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 34","content":"158 For free distribution Hyperlinks to other web pages Hyperlink to another website Figure 5.38 - Home Page This home page contains the title, images of human systems, a short description, hyperlinks to the other five web pages and further details. This website can be designed using any web designing software you prefer. The steps to design it using kompozer software are as follows. Step 01 - Figure 5.39 shows the interface after installing kompozer. exe file in kompozer software ( E.g. - www.kompozer.net/download-07.php). to insert tables to insert pictures to attach files web page designing area to see HTML code to preview to format letters and texts Figure 5.39 - Interface of Kompozer software For more information....... 2015 For the grade 11 ICT book","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f309eefa6f5e844935e"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 35","content":"For free distribution 159 Step 02 - Type the title “Systems in Human Body” on the topmost in web designing area. Format the title by changing font, type, size, colour and background colour. Step 03 - Using commands in File Menu, save it in a suitable folder with a suitable name. Preview your webpage using a web browser. д נּ רּ 42 : וֹ Řוֹ ş סĭ Ī Ćг צּ בּ ן ךּתּ פֿם וֹ ךּ ٍ ד � ◄ וֹ Figure 5.40 - Dialog Box to insert a table Step 04 - Though the image and other texts can be included as given above, use of a proper content layout makes the task easier. Let us include a table for this. Get the Dialog Box given in Figure 5.40 using “Insert Menu” or “Table tool” in Menu bar. Insert a table with 6 raws and 3 columns. Step 05 - As in word processing, the table can be formatted to change size of cells, insert, delete and merge cells. Format the table as in figure 5.41. Systems of the Human Body Figure 5.41 - Arrangement of cells in the table","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f309eefa6f5e8449361"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 36","content":"160 For free distribution Step 06 - Format the table including texts, images, hyperlinks as in Figure 5.39. It is easier if all the images used to design web pages are saved in one folder. Step 07 - New pages can be opened using “New tool”. Create separate pages for each system on the Home Page. Save these in the same folder using suitable names. Step 08 - After forming hyperlinks to the relevant pages, preview the web page and format as necessary. 5.2.2 Static websites and dynamic websites There are two types of websites according to the nature of its content as static and dynamic. 1. Static Websites If the content of a website is maintained without any change over a period of time, such a website is called a static website. Normally, websites based on HTML language are static websites. Their structure and content are designed using HTML codes. The web content can be changed only by changing the code. This kind of websites can be designed in a very simple way as a collection of a number of web pages. Users are not directly connected to the web server when using the websites. Only the designer of the website can enter the relevant changes by connecting to the web server where the website is hosted. These websites are safer even though it consumes more time for coding. Websites that were created so far using word processing software, HTML editor, web editor etc are static web sites. 2. Dynamic Websites If the web content is often changed, such a website is called a dynamic website. These are designed using software such as PHP (Hypertext Preprocessor), ASP.net (Active Server Page.net), JSP(Java Server Page). Here the web server generates information using a data base or program. Example: 1. Current time is displayed as dynamic in a website. 2. Showing results of a candidate related to the index number.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f309eefa6f5e8449364"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 37","content":"For free distribution 161 Users are directly connected to the web server while using such websites. Information is exchanged from the user to web server or vice versa. Hence, the security of the website is threatened compared to a static website. This is more appropriate for commercial, social or exam holding websites which should be often changed. However, higher knowledge and experience are required to build such websites in a protective way. Server Client/browser Static Web server Database server Client/browser Dynamic Figure 5.42 - Static and dynamic websites 5.2.3 Content Management Systems (CMS) CMS can be defined as software used for dynamic website designing, content management and publishing. It is possible for the web designer to re-publish his website often changing its content. Web designing and managing using CMS is very easy and fast, while no prior knowledge of computer languages is required. Hence, CMS is the most popular web designing tool at present. The creativity of designing is limited to a certain range if various audio visual information is entered to the website using templates and wizards provided by the software. All the websites that are designed this way will be monotonous. This weakness can be largely avoided by changing relevant codes if you possess a sound knowledge of computer languages such as HTML, PHP, javascript, CSS, SQL.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f329eefa6f5e8449367"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 38","content":"162 For free distribution Some open code CMS software with their web addresses are as follows. 1. Joomla (www.joomla.org/download.html) 2. Wordpress (www.wordpress.org/download) 3. Drupal (www.drupal.org/download) How a website is designed using a CMS software You can design this website using any CMS software you prefer and the steps to install ''Joomla'' software are as follows. Step 01 - Install the three types of software given below in your computer. The web addresses required to download these are also given. 1. APACHE (www.apache.org) 2. PHP(www.php.net) 3. MySql (www.mysql.com) However, it is easier to install a single package which includes all the above two such software are as follows. 1. WAMP (www.wampserver.com) 2. XAMPP (www.apachefriends.org/index.html) Step 02 - Download Joomla software from www.joomla.org website and install it in your computer. Since there are lots of steps here, get necessary advice from a suitable website. Example - https://docs.joomla.org/J3.x:Installing_Joomla Step 03 - There is need to select proper templates, articles and components for a new website. Get necessary advice for this from a suitable website. Step 04 - See the preview and do the necessary changes to your website. Activity Build the website your team planned using Joomla software.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f339eefa6f5e844936a"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 39","content":"For free distribution 163 5.2.4 Roles related to web designing Designing a website for a certain institute and maintaining it while keeping it updated is a team work involving in many people. Each person has a role to play with the relevant tasks and many responsibilities. Let us identify some important roles among those. 1. Author - Designs interfaces of the website 2. Editor - Writes codes, checks errors and rectifies those. 3. Publisher - Fulfills tasks related to the publishing of the website. 4. Administrator - Fulfills maintenance tasks related to the web server and database. 5. Users - Use the website. 5.3 Publication of a website Publication of a website includes the tasks such as designing website, hosting, updating and posting etc. There are several requirements a web publisher should fulfill for this. 1. A web designing software 2. A web host 3. A domain name 4. File transfer protocol 5. Internet connection 5.3.1 Web Host The designed website should be hosted in a place where any person can access at any time from any place through Internet. Such service providing computers are called web hosts. If the website is designed for a mass scale institute, normally they have their own dedicated host. If it is for a small scale institute, they get space from shared hosts maintained by other institutes. Shared hosts charge basic fee and annual charge according to the allocated capasity. There are many institutes in Sri Lanka as well as in the world which provide such web host services. There are institutes which provide web host services free of charge as well. You can get this facility through various websites. Here, their advertisements are also displayed in your website.","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f349eefa6f5e844936d"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 40","content":"164 For free distribution Activity Name two institutes which provide free web host services along with their relevant web addresses. 5.3.2 Domain Name National identity number is given to each and every person in the world to identify a person uniquely. In the same way, there is a system to find a website in the World Wide Web. It is known as ICANN (Internet Corporation for Assigned Names and Numbers) that bears the responsibility of assigning and administrating domain names for websites. After designing a website, it should be registered in that institute with a suitable domain name. Some of such other institutes are as follows. 1. www.godaddy.com 2. www.bluehost.com 3. ww.nic.lk It is more appropriate to get registered paying a basic fee. Registration should be renewed paying an annual fee. Sometimes, it is done by the person who is responsible for hosting. However, if you need to host your website in another web host later, this can create issues on registration. Hence, it is more appropriate if the publisher himself registers the website. Things to consider when selecting a domain name to a website. 1. It is appropriate to give a certain identification about the institute the website belongs to or the objective of preparing the website through the domain name. This makes the users easier to find the website through search engines. Example: The web address www.nie.lk indicates the institute the website belongs to the user by the domain name “nie”. 2. According to the nature of the website, top level domain names such as “.com”, “.edu”, “.org”,“.lk” can be attached. Example: The top level domain name “.org” of the web address www. wikipedia.org indicates that it belongs to non commercial type websites. Organizational hierarchy Geographic hierarchy .(Root) com edu uk fr pe sp jp cd gr ... mil gov net ... ... Figure 5.43 - Domain names of websites","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f359eefa6f5e8449370"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 41","content":"For free distribution 165 3. If the domain name is short, it is easy for the user to remember it as well as to type it accurately. 4. It is not appropriate to include numbers, lines, in domain name. The reason for this is when the web address is read orally, it may not be communicated correctly to the listener. Example: Reader Listener www.myweb2.org www.mywebtu.org Activity Visit www.nic.lk and study the steps to obtain .lk domain name. 5.3.3 File Transfer Protocol/FTP These are the software used to transfer the website you have designed to the selected web host according to the international standards. These can be purchased or downloaded free from Internet. Example - 1. Filezilla (https://filezilla-project.org) 2. SmartFTP (https://www.smartftp.com) Since most of the web designing tools include file transfer facility as well, another software is not needed. Further, the institutes which provide shared host services too provide the facility of file transferring. 5.3.4 Internet Connection Internet connection is essential for the three steps of publishing a website – transferring, updating and path declaration. Internet connection is the medium which connects the users with the web host. A proper Internet service provider should be selected to get Internet connection. Things such as the speed of the connection, charges, and maintenance services should be considered here. Some Internet service providers in Sri Lanka are as follows.. 1. Sri Lanka Telecom 2. Lanka Bell 3. Mobitel 4. Dialog Axiata","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f359eefa6f5e8449373"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 42","content":"166 For free distribution 5.3.5 Maintenance of Website Regular maintenance is an essential factor for the success of a website. This can be explained from several aspects. 1. Depending on the nature of the website, its content should be updated daily, weekly or monthly. Not only should the content of the website be changed here, but also the way it is presented, pictures, colours, shapes and other objects should be changed. By maintaining a column on the Home Page to publish new information, current changes can be updated instantly. 2. Harmful software like viruses, unauthorized access can create the website malfunction. Hence, regular attention should be paid, while getting back up time to time and proper security methods should be followed. 3. If there are new versions of the software used to design the website, website should be updated accordingly. It is important for the security of the website. Activity Publish the website your team has designed following proper steps. Website designing and development process can be summarized as follows; 1) The concept 3) Domain name 2) Design develop 4) Hosting 5) Upload 6) Test 7) Update and manage Stages in web design and development Figure 5.44 - Steps of web design and development","chapter":"Web Designing Using Multimedia","__v":0}
{"_id":{"$oid":"68aa8f369eefa6f5e8449376"},"title":"ICT G-11 E (1).pdf","pageNumber":"Page 43","content":"For free distribution 167 ² In web designing, it is essential to design it with a structure and a pre design, and organize it well with the proper content which suits the needs of the users of the web site. ² Depending on the content, there are two types of web sites – static and dynamic. ² HTML is the basic language used for web designing. Knowledge of this language is essential to be a successful web editor. This makes writing HTML codes easier. ² Simple web sites can be designed even without any knowledge of HTML language, using the software such as web authoring tools and Content Management Systems. ² Dynamic web sites can be designed using Content Management Systems. ² A suitable web host, domain name, and a file transfer protocol should be selected to publish a designed web site. ² There should be a maintenance process for the success of a web site. Summary","chapter":"Web Designing Using Multimedia","__v":0}
